# Core Components
hyprland
waybar
dunst
wofi
wlogout
xdg-desktop-portal-hyprland
hyprpaper
hypridle
hyprlock

# Terminal & Shell
kitty
starship
zsh
fastfetch
micro
btop
zsh-completions
zsh-autosuggestions
zsh-syntax-highlighting

# File Management & GUI Tools
thunar
thunar-archive-plugin
file-roller
nwg-look
nwg-displays
pavucontrol
polkit-gnome
qt5ct
qt6ct
gnome-keyring

# Network & Bluetooth
network-manager-applet
blueman
bluez
bluez-utils

# Clipboard Manager
wl-clipboard
cliphist

# Media & Audio
grim
slurp
pamixer
brightnessctl

# Fonts
ttf-jetbrains-mono-nerd
noto-fonts-emoji

# Themes & Icons
tokyonight-gtk-theme-git
papirus-icon-theme
bibata-cursor-theme

# Browsers (Optional but recommended)
brave-bin

# Utilities
7zip
acpi
acpid
binwalk
unzip
zip
zram-generator

# System/Firmware
aic94xx-firmware
base
ffmpegthumbnailer
gvfs
gvfs-afc
gvfs-mtp
intel-ucode
lib32-vulkan-icd-loader
linux
linux-firmware
linux-firmware-qlogic
linux-headers
linux-lts
linux-lts-headers
nbfc-linux
vulkan-intel
vulkan-tools
wd719x-firmware
xf86-video-amdgpu
xf86-video-ati
xf86-video-nouveau
xorg-server
xorg-xgamma
xorg-xinit

# Audio/Video
alsa-plugins
audacity
celluloid
easyeffects
gst-plugin-pipewire
lib32-pipewire
obs-studio
pipewire
pipewire-alsa
pipewire-jack
pipewire-libcamera
pipewire-pulse
sof-firmware
wireplumber

# Development Tools
base-devel
bazel
cmake
docker
docker-buildx
docker-compose
extra-cmake-modules
ghc-filesystem
ghostscript
git
github-cli
go
google-chrome
jadx
jdk17-openjdk
jdk8-openjdk
lazygit
mangohud
mingw-w64-gcc
ninja
nodejs
npm
play-with-mpv-git
python-build
python-docx
python-installer
python-ipykernel
python-pandas
python-pillow
python-pipx
python-psutil
python-pwntools
python-pynacl
python-scikit-learn
python-seaborn
python-tensorflow
python-yellowbrick
python311
python312
python313
rust
steghide

# Networking Tools
assetnote-wordlists
nmap
trae-bin
wget

# GUI Applications
discord
libreoffice-fresh
qbittorrent
termius
zapzap

# Shell & CLI Tools
fzf
jq

# Fonts & Themes
noto-fonts-cjk
noto-fonts-extra
plymouth-theme-arch-charge
terminus-font
ttf-dejavu
ttf-firacode-nerd
ttf-hack-nerd
ttf-ms-fonts

# Uncategorized/Others
antigravity
antigravity-tools-bin
autorandr
awww
bridge-utils
bun
checksec
clang
clang20
cloudflare-warp-bin
cloudflared
cpupower
cuda
cudnn
cups
dialog
dmidecode
dnsmasq
dosbox
dosfstools
dxvk-bin
earlyoom
efibootmgr
electron37
elyprismlauncher
evtest
ex-vi-compat
expac
eza
feh
firejail
flatpak
flite
gamemode
gammastep
gdb
gnome-desktop
gparted
gradle
grub
gst-plugins-bad
gst-plugins-ugly
helvum
htop
hyprpicker
hyprshade
imagemagick
imv
intel-media-driver
iptables
iwd
java-openjfx-bin
john
jupyter-notebook
kotlin
kvantum
kvantum-qt5
less
lib32-alsa-lib
lib32-gamemode
lib32-gnutls
lib32-libpulse
lib32-nvidia-utils
lib32-vkd3d
libcamera
libfido2
libgphoto2
libnotify
libpulse
libva-nvidia-driver
libva-utils
libvirt
lld
ltrace
lutris
ly
mariadb-clients
nano
ncdu
ncurses5-compat-libs
nethogs
networkmanager
noise-suppression-for-voice
ntfs-3g
nvidia-open-dkms
nvidia-prime
nvidia-utils
openbsd-netcat
opencode-bin
orca
os-prober
pacman-contrib
paru
php
plymouth
pyenv
pyprland
qt5-wayland
qt6-virtualkeyboard
qt6-wayland
radare2
reflector
rsync
ruby
samba
sane
scdoc
scrcpy
screen
seahorse
seclists
sklauncher-bin
smartmontools
sox
steamcmd
strace
stress
swappy
swaync
systemd-resolvconf
thermald
timeshift
tk
tlp
tlp-rdw
tree
ttyd
tumbler
ufw
unixodbc
unrar
upd72020x-fw
upx
uv
uwsm
v4l2loopback-dkms
vde2
vim
virt-viewer
visual-studio-code-bin
visualvm
vkd3d
wasi-libc
wine
wine-gecko
wine-mono
winetricks
wireless_tools
wl-clip-persist
wlr-randr
xdg-desktop-portal-gtk
xdg-utils
yay-debug
zathura
zathura-pdf-mupdf
lib32-llvm-libs
